app/controllers/api/creators_controller.rb

  def index
    creators = Creator.limit(@limit).offset(@offset).order(:created_at => :desc)
---
SELECT "creators".* FROM "creators"   ORDER BY "creators"."created_at" DESC

  def show
    @creator = Creator.find(params[:id])
---
SELECT  "creators".* FROM "creators"  WHERE "creators"."id" = ? LIMIT 1  [["id", 1]]

  def eventsbycreator
    creators = Creator.find(params[:id])
---
SELECT  "creators".* FROM "creators"  WHERE "creators"."id" = ? LIMIT 1  [["id", 1]]