app/controllers/api/events_controller.rb

  def index
    events = Event.limit(@limit).offset(@offset)
---
SELECT  "events".* FROM "events"   ORDER BY "events"."created_at" DESC LIMIT 20 OFFSET 0