app/controllers/api/tags_controller.rb

  def index
    tags = Tag.limit(@limit).offset(@offset).order(:created_at => :desc)
---
SELECT "tags".* FROM "tags"   ORDER BY "tags"."created_at" DESC

  def tagevents
    tags = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]