app/views/apikeys/show.html.erb

  <div class ="col-md-6 col-md-offset-5">
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"