app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.api_key = SecureRandom.hex

    if @user.save
---
INSERT INTO "users" ("api_key", "created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def login
    u = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'test@gmail.se' LIMIT 1

  def destroy
    @user = User.find(params[:id])
    @user.update_attribute(:api_key, nil)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "api_key" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["api_key", nil], ["updated_at", "2015-02-11 10:28:41.891429"]]